> (dot-product (list 1 2 3 4) (list 1 2 3 4))
30
> (matrix-*-vector (list (list 1 2 3) (list 4 5 6) (list 7 8 9)) (list 1 2 3))
(14 32 50)
> (transpose (list (list 1 2 3) (list 4 5 6)))
((1 4) (2 5) (3 6))
> (matrix-*-matrix (list (list 1 2 3) (list 4 5 6) (list 7 8 9)) (list (list 1 2 3) (list 4 5 6) (list 7 8 9)))
((30 36 42) (66 81 96) (102 126 150))