> (((add two two) inc) 1)
5
> (((add one one) inc) 1)
3
> (((add two one) inc) 1)
4
> (((add two (add two two)) inc) 1)
7